turbq/atprog/packs/atmel/SAM3S_DFP/1.0.70/sam3sd8/atdf/ATSAM3SD8B.atdf
        <register caption="Endpoint Control and Status Register 6" name="UDP_CSR6" offset="0x48" rw="RW" size="4">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
        <register caption="Endpoint Control and Status Register 7" name="UDP_CSR7" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
        <register caption="Endpoint FIFO Data Register 0" name="UDP_FDR0" offset="0x50" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 1" name="UDP_FDR1" offset="0x54" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 2" name="UDP_FDR2" offset="0x58" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 3" name="UDP_FDR3" offset="0x5C" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 4" name="UDP_FDR4" offset="0x60" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 5" name="UDP_FDR5" offset="0x64" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 6" name="UDP_FDR6" offset="0x68" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 7" name="UDP_FDR7" offset="0x6C" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Transceiver Control Register" name="UDP_TXVC" offset="0x074" rw="RW" size="4">
          <bitfield caption="Transceiver Disable" mask="0x00000100" name="TXVDIS"/>
          <bitfield caption="Pull-up On" mask="0x00000200" name="PUON"/>
        </register>
      </register-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
    </module>
